In [1]:
import pandas as pd

In [2]:
patients = pd.read_csv("patients.csv")
visits = pd.read_csv("visits.csv")
treatments = pd.read_csv("treatments.csv")
payments = pd.read_csv("payments.csv")

In [ ]:
############################################ PATIENT TABLE ################################

In [3]:
patients.head(20)

,patient_id,full_name,gender,date_of_birth,phone,email
0,P001,Lerato Dlamini,M,1978-11-03,839876543.0,example@gmail.com
1,P002,Sipho Ndlovu,M,1988-09-18,821234567.0,NaN
2,P003,NaN,M,1985-04-12,821234567.0,example@gmail.com
3,P004,Ayesha Khan,NaN,1988-09-18,821234567.0,NaN
4,P005,Ayesha Khan,NaN,1990-02-30,839876543.0,NaN
5,P006,John Smith,M,1992/07/25,NaN,NaN
6,P007,John Smith,F,1992/07/25,NaN,example@gmail.com
7,P008,Lerato Dlamini,Female,1985-04-12,NaN,NaN
8,P009,John Smith,M,1990-02-30,821234567.0,NaN
9,P010,Lerato Dlamini,NaN,1978-11-03,NaN,NaN
10,P011,Ayesha Khan,M,1985-04-12,839876543.0,NaN
11,P012,Lerato Dlamini,F,1985-04-12,NaN,NaN
12,P013,Michael Brown,Male,1992/07/25,NaN,NaN
13,P014,Ayesha Khan,Male,1985-04-12,839876543.0,NaN
14,P015,Ayesha Khan,F,1990-02-30,NaN,NaN
15,P016,Ayesha Khan,Male,1985-04-12,839876543.0,example@gmail.com
16,P017,Nomsa Khumalo,Female,1978-11-03,821234567.0,example@gmail.com
17,P018,Nomsa Khumalo,F,1990-02-30,NaN,NaN
18,P019,Michael Brown,F,1978-11-03,839876543.0,example@gmail.com
19,P020,John Smith,NaN,1990-02-30,NaN,NaN

In [4]:
# Trim Patient names
patients["full_name"] = (
    patients["full_name"]
    .str.strip()
    .str.replace(r"\s+", " ", regex=True)
)

In [5]:
patients["full_name"]

0      Lerato Dlamini
1        Sipho Ndlovu
2                 NaN
3         Ayesha Khan
4         Ayesha Khan
            ...
195     Michael Brown
196      Sipho Ndlovu
197        John Smith
198    Lerato Dlamini
199     Michael Brown
Name: full_name, Length: 200, dtype: object

In [12]:
# Replace None / NaN with (Unknown)
patients['full_name'] = patients['full_name'].fillna('Unknown Patient')

In [10]:
patients["full_name"]

0      Lerato Dlamini
1        Sipho Ndlovu
2                 NaN
3         Ayesha Khan
4         Ayesha Khan
            ...
195     Michael Brown
196      Sipho Ndlovu
197        John Smith
198    Lerato Dlamini
199     Michael Brown
Name: full_name, Length: 200, dtype: object

In [6]:
# Standardise gender
patients["gender"] = (
    patients["gender"]
    .str.strip()
    .str.lower()
    .map({
        "male": "M",
        "m": "M",
        "female": "F",
        "f": "F"
    })
)

In [7]:
patients["gender"]

0        M
1        M
2        M
3      NaN
4      NaN
      ...
195      M
196      F
197      M
198      M
199    NaN
Name: gender, Length: 200, dtype: object

In [8]:
# Replace None / NaN with 'U' (Unknown)
patients['gender'] = patients['gender'].fillna('Unknown')

In [16]:
patients

,patient_id,full_name,gender,date_of_birth,phone,email
0,P001,Lerato Dlamini,M,1978-11-03,839876543.0,example@gmail.com
1,P002,Sipho Ndlovu,M,1988-09-18,821234567.0,NaN
2,P003,Unknown Patient,M,1985-04-12,821234567.0,example@gmail.com
3,P004,Ayesha Khan,Unknown,1988-09-18,821234567.0,NaN
4,P005,Ayesha Khan,Unknown,1990-02-30,839876543.0,NaN
...,...,...,...,...,...,...
195,P196,Michael Brown,M,1988-09-18,NaN,example@gmail.com
196,P197,Sipho Ndlovu,F,1992/07/25,821234567.0,NaN
197,P198,John Smith,M,1988-09-18,NaN,NaN
198,P199,Lerato Dlamini,M,1988-09-18,NaN,NaN
199,P200,Michael Brown,Unknown,1985-04-12,821234567.0,example@gmail.com

In [17]:
# Convert date_of_birth to datetime
# Invalid dates (e.g. 1990-02-30) will become NaT

# Ensure column is string before replacing
patients['date_of_birth']= patients['date_of_birth'].astype(str)
patients['date_of_birth']= patients['date_of_birth'].str.replace('/', '-', regex=False)

patients['date_of_birth']= pd.to_datetime(
    patients['date_of_birth'],
    format='%Y-%m-%d',
    errors='coerce'
)

In [18]:
patients

,patient_id,full_name,gender,date_of_birth,phone,email
0,P001,Lerato Dlamini,M,1978-11-03,839876543.0,example@gmail.com
1,P002,Sipho Ndlovu,M,1988-09-18,821234567.0,NaN
2,P003,Unknown Patient,M,1985-04-12,821234567.0,example@gmail.com
3,P004,Ayesha Khan,Unknown,1988-09-18,821234567.0,NaN
4,P005,Ayesha Khan,Unknown,NaT,839876543.0,NaN
...,...,...,...,...,...,...
195,P196,Michael Brown,M,1988-09-18,NaN,example@gmail.com
196,P197,Sipho Ndlovu,F,1992-07-25,821234567.0,NaN
197,P198,John Smith,M,1988-09-18,NaN,NaN
198,P199,Lerato Dlamini,M,1988-09-18,NaN,NaN
199,P200,Michael Brown,Unknown,1985-04-12,821234567.0,example@gmail.com

In [25]:
# Convert phone numbers to string
patients['phone'] = patients['phone'].astype('string')

# Remove '.0' caused by float conversion
patients['phone'] = patients['phone'].str.replace('.0', '', regex=False)

# Replace missing phones
patients['phone'] = patients['phone'].fillna('Not Provided')

# Add leading zero
patients['phone'] = '0' + patients['phone']

In [26]:
patients

,patient_id,full_name,gender,date_of_birth,phone,email
0,P001,Lerato Dlamini,M,1978-11-03,0839876543,example@gmail.com
1,P002,Sipho Ndlovu,M,1988-09-18,0821234567,NaN
2,P003,Unknown Patient,M,1985-04-12,0821234567,example@gmail.com
3,P004,Ayesha Khan,Unknown,1988-09-18,0821234567,NaN
4,P005,Ayesha Khan,Unknown,NaT,0839876543,NaN
...,...,...,...,...,...,...
195,P196,Michael Brown,M,1988-09-18,0Not Provided,example@gmail.com
196,P197,Sipho Ndlovu,F,1992-07-25,0821234567,NaN
197,P198,John Smith,M,1988-09-18,0Not Provided,NaN
198,P199,Lerato Dlamini,M,1988-09-18,0Not Provided,NaN
199,P200,Michael Brown,Unknown,1985-04-12,0821234567,example@gmail.com

In [28]:
# Replace missing emails
patients['email'] = patients['email'].fillna('Not Provided')

# Standardise email case
patients['email'] = patients['email'].str.lower()

In [33]:
# Identify duplicates based on name + DOB
patients = patients.drop_duplicates(
    subset=['full_name', 'date_of_birth'],
    keep='first'
)

In [34]:
patients.info()

<class 'pandas.core.frame.DataFrame'>
Index: 40 entries, 0 to 152
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   patient_id     40 non-null     object
 1   full_name      40 non-null     object
 2   gender         40 non-null     object
 3   date_of_birth  32 non-null     datetime64[ns]
 4   phone          40 non-null     string
 5   email          40 non-null     object
dtypes: datetime64[ns](1), object(4), string(1)
memory usage: 2.2+ KB

In [36]:
patients.head(10)

,patient_id,full_name,gender,date_of_birth,phone,email
0,P001,Lerato Dlamini,M,1978-11-03,0839876543,example@gmail.com
1,P002,Sipho Ndlovu,M,1988-09-18,0821234567,not provided
2,P003,Unknown Patient,M,1985-04-12,0821234567,example@gmail.com
3,P004,Ayesha Khan,Unknown,1988-09-18,0821234567,not provided
4,P005,Ayesha Khan,Unknown,NaT,0839876543,not provided
5,P006,John Smith,M,1992-07-25,0Not Provided,not provided
7,P008,Lerato Dlamini,F,1985-04-12,0Not Provided,not provided
8,P009,John Smith,M,NaT,0821234567,not provided
10,P011,Ayesha Khan,M,1985-04-12,0839876543,not provided
12,P013,Michael Brown,M,1992-07-25,0Not Provided,not provided

In [ ]:
############################################ VISITS TABLE ################################

In [38]:
visits.head(20)

   visit_id patient_id  visit_date appointment_time visit_status
0     V0001       P162  16/12/2024            10:30    Completed
1     V0002       P112  2024-02-20              NaN      No Show
2     V0003       P178  2024-06-02            09:00    Cancelled
3     V0004       P015  30/05/2024            14:00    completed
4     V0005       P038  05/05/2024            10:30      No Show
5     V0006       P045  10/02/2024            10:30    completed
6     V0007       P150  2024-03-14              NaN    Cancelled
7     V0008       P118  2024-05-10              NaN    Cancelled
8     V0009       P174  2024-10-06            09:00    completed
9     V0010       P089  27/10/2024              NaN    Cancelled
10    V0011       P117  2024-06-03              NaN    completed
11    V0012       P028  01/05/2024            14:00    Cancelled
12    V0013       P180  2024-05-31              NaN    Cancelled
13    V0014       P003  2024-10-16              NaN    Cancelled
14    V0015       P199  27/04/2024            10:30      No Show
15    V0016       P159  2024-05-08            09:00    Completed
16    V0017       P080  2024-08-13            14:00      No Show
17    V0018       P024  31/05/2024              NaN      No Show
18    V0019       P052  08/03/2024            14:00      No Show
19    V0020       P066  03/09/2024            14:00    Completed

In [56]:
# Convert date_of_birth to datetime
# Invalid dates (e.g. 1990-02-30) will become NaT

# Ensure column is string before replacing
visits['visit_date']= visits['visit_date'].astype(str).str.strip()
visits['visit_date']= visits['visit_date'].str.replace('/', '-', regex=False)

d1 = pd.to_datetime(visits['visit_date'], format='%Y-%m-%d', errors='coerce')
d2 = pd.to_datetime(visits['visit_date'], format='%d-%m-%Y', errors='coerce')

visits['visit_date'] = d1.fillna(d2)

In [57]:
visits.head(20)

   visit_id patient_id visit_date appointment_time visit_status
0     V0001       P162 2024-12-16            10:30    Completed
1     V0002       P112 2024-02-20              NaN      No Show
2     V0003       P178 2024-06-02            09:00    Cancelled
3     V0004       P015 2024-05-30            14:00    completed
4     V0005       P038 2024-05-05            10:30      No Show
5     V0006       P045 2024-02-10            10:30    completed
6     V0007       P150 2024-03-14              NaN    Cancelled
7     V0008       P118 2024-05-10              NaN    Cancelled
8     V0009       P174 2024-10-06            09:00    completed
9     V0010       P089 2024-10-27              NaN    Cancelled
10    V0011       P117 2024-06-03              NaN    completed
11    V0012       P028 2024-05-01            14:00    Cancelled
12    V0013       P180 2024-05-31              NaN    Cancelled
13    V0014       P003 2024-10-16              NaN    Cancelled
14    V0015       P199 2024-04-27            10:30      No Show
15    V0016       P159 2024-05-08            09:00    Completed
16    V0017       P080 2024-08-13            14:00      No Show
17    V0018       P024 2024-05-31              NaN      No Show
18    V0019       P052 2024-03-08            14:00      No Show
19    V0020       P066 2024-09-03            14:00    Completed

In [59]:
# appointment_time: keeping NaN (correct for No Show / Cancelled)
# But make sure it's a string/time type
visits['appointment_time'] = visits['appointment_time'].astype('string')

In [63]:
visits.head()

  visit_id patient_id visit_date appointment_time visit_status
0    V0001       P162 2024-12-16            10:30    Completed
1    V0002       P112 2024-02-20             <NA>      No Show
2    V0003       P178 2024-06-02            09:00    Cancelled
3    V0004       P015 2024-05-30            14:00    completed
4    V0005       P038 2024-05-05            10:30      No Show

In [62]:
visits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   visit_id          500 non-null    object
 1   patient_id        500 non-null    object
 2   visit_date        500 non-null    datetime64[ns]
 3   appointment_time  361 non-null    string
 4   visit_status      500 non-null    object
dtypes: datetime64[ns](1), object(3), string(1)
memory usage: 19.7+ KB

In [64]:
############################################ TREATMENTS TABLE ################################

In [65]:
treatments

  treatment_id         treatment_name category
0          T01  Physiotherapy Session    Rehab
1          T02        physio session     Rehab
2          T03        Dental Cleaning   Dental
3          T04           CONSULTATION  General
4          T05           Consultation  General

In [67]:
treatments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   treatment_id    5 non-null      object
 1   treatment_name  5 non-null      object
 2   category        5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [72]:
# Standardise text
treatments['treatment_name'] = (
    treatments['treatment_name']
    .str.strip()
    .str.lower()
    .str.title()
)

treatments['category'] = (
    treatments['category']
    .str.strip()
    .str.lower()
    .str.title()
)

In [73]:
treatments

  treatment_id         treatment_name category
0          T01  Physiotherapy Session    Rehab
1          T02         Physio Session    Rehab
2          T03        Dental Cleaning   Dental
3          T04           Consultation  General
4          T05           Consultation  General

In [ ]:
############################################ PAYMENTS TABLE ################################

In [75]:
payments.head(30)

   payment_id visit_id treatment_id  amount_paid payment_date payment_method
0     PAY0001    V0052          T03          200          NaN            EFT
1     PAY0002    V0339          T03          300   2024-05-01           Cash
2     PAY0003    V0202          T05          600   2024-09-08           Cash
3     PAY0004    V0185          T01          450          NaN           CASH
4     PAY0005    V0103          T01            0   2024-04-15            EFT
5     PAY0006    V9999          T01          450          NaN           CASH
6     PAY0007    V0242          T04          300          NaN           CASH
7     PAY0008    V0095          T03          450   2024-07-08           CASH
8     PAY0009    V0023          T03          450          NaN           Card
9     PAY0010    V0429          T03          600   2024-02-01           Cash
10    PAY0011    V0044          T03          600          NaN           Card
11    PAY0012    V0284          T01          450          NaN           CASH
12    PAY0013    V0294          T02          450   2024-06-02           CASH
13    PAY0014    V0463          T01          600          NaN           Card
14    PAY0015    V0062          T04          200   2024-03-26           Card
15    PAY0016    V0065          T01          450          NaN           CASH
16    PAY0017    V0104          T02          600          NaN           Cash
17    PAY0018    V0045          T04          600          NaN            EFT
18    PAY0019    V0439          T03          600   2024-08-22           CASH
19    PAY0020    V0058          T04          200          NaN           Cash
20    PAY0021    V0474          T01          600          NaN            EFT
21    PAY0022    V0450          T04          300          NaN           CASH
22    PAY0023    V0293          T05          450   2024-01-20            EFT
23    PAY0024    V0207          T02          600          NaN           CASH
24    PAY0025    V0020          T04          300   2024-12-19           Cash
25    PAY0026    V0382          T04          300   2024-07-09            EFT
26    PAY0027    V0419          T03          300          NaN           Cash
27    PAY0028    V0498          T02          200          NaN           CASH
28    PAY0029    V0397          T03          300          NaN           Cash
29    PAY0030    V0097          T04          200          NaN           CASH

In [77]:
payments['payment_date'].head(10)

0           NaN
1    2024-05-01
2    2024-09-08
3           NaN
4    2024-04-15
5           NaN
6           NaN
7    2024-07-08
8           NaN
9    2024-02-01
Name: payment_date, dtype: object

In [79]:
# Convert payment_date to datetime
payments["payment_date"] = pd.to_datetime(
    payments["payment_date"], errors="coerce"
)

In [82]:
# Standardise payment_method
payments["payment_method"] = (
    payments["payment_method"]
    .str.strip()
    .str.upper()
)

payments["payment_method"] = payments["payment_method"].replace({
    "CASH": "Cash",
    "CARD": "Card",
    "EFT": "EFT"
})

In [84]:
# Remove invalid visit_id
payments = payments[payments["visit_id"] != "V9999"]

In [85]:
payments.info()

<class 'pandas.core.frame.DataFrame'>
Index: 499 entries, 0 to 499
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      499 non-null    object
 1   visit_id        499 non-null    object
 2   treatment_id    499 non-null    object
 3   amount_paid     499 non-null    int64
 4   payment_date    161 non-null    datetime64[ns]
 5   payment_method  499 non-null    object
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 27.3+ KB

In [ ]:
########### Connecting to SSMS database #####

In [86]:
!pip install pyodbc sqlalchemy

Requirement already satisfied: pyodbc in c:\users\odaho\anaconda3\lib\site-packages (5.3.0)
Requirement already satisfied: sqlalchemy in c:\users\odaho\anaconda3\lib\site-packages (2.0.43)
Requirement already satisfied: greenlet>=1 in c:\users\odaho\anaconda3\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\odaho\anaconda3\lib\site-packages (from sqlalchemy) (4.15.0)

In [87]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus

In [88]:
# SQL Server details
server = "localhost\\DESKTOP-AS63281\SQLEXPRESS"   
database = "Clinic_Performance"

# Build connection string
params = quote_plus(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    f"SERVER={server};"
    f"DATABASE={database};"
    "Trusted_Connection=yes;"
)

engine = create_engine(f"mssql+pyodbc:///?odbc_connect={params}")

print("Connected successfully!")

Connected successfully!

In [89]:
from sqlalchemy import create_engine
from urllib.parse import quote_plus
import pandas as pd

server = "DESKTOP-AS63281\\SQLEXPRESS"
database = "Clinic_Performance"

params = quote_plus(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    f"SERVER={server};"
    f"DATABASE={database};"
    "Trusted_Connection=yes;"
)

engine = create_engine(f"mssql+pyodbc:///?odbc_connect={params}")

print("Engine created")

Engine created

In [91]:
# Write DataFrame to SQL Server
patients.to_sql("patients", engine, if_exists="replace", index=False)

# Read back sample (SQL Server uses TOP instead of LIMIT)
pd.read_sql("SELECT TOP 5 * FROM patients;", engine)

,patient_id,full_name,gender,date_of_birth,phone,email
0,P001,Lerato Dlamini,M,1978-11-03,0839876543,example@gmail.com
1,P002,Sipho Ndlovu,M,1988-09-18,0821234567,not provided
2,P003,Unknown Patient,M,1985-04-12,0821234567,example@gmail.com
3,P004,Ayesha Khan,Unknown,1988-09-18,0821234567,not provided
4,P005,Ayesha Khan,Unknown,NaT,0839876543,not provided

In [92]:
# Write DataFrame to SQL Server
visits.to_sql("visits", engine, if_exists="replace", index=False)

# Read back sample (SQL Server uses TOP instead of LIMIT)
pd.read_sql("SELECT TOP 5 * FROM visits;", engine)

  visit_id patient_id visit_date appointment_time visit_status
0    V0001       P162 2024-12-16            10:30    Completed
1    V0002       P112 2024-02-20             None      No Show
2    V0003       P178 2024-06-02            09:00    Cancelled
3    V0004       P015 2024-05-30            14:00    completed
4    V0005       P038 2024-05-05            10:30      No Show

In [93]:
# Write DataFrame to SQL Server
treatments.to_sql("treatments", engine, if_exists="replace", index=False)

# Read back sample (SQL Server uses TOP instead of LIMIT)
pd.read_sql("SELECT TOP 5 * FROM treatments;", engine)

  treatment_id         treatment_name category
0          T01  Physiotherapy Session    Rehab
1          T02         Physio Session    Rehab
2          T03        Dental Cleaning   Dental
3          T04           Consultation  General
4          T05           Consultation  General

In [94]:
# Write DataFrame to SQL Server
payments.to_sql("payments", engine, if_exists="replace", index=False)

# Read back sample (SQL Server uses TOP instead of LIMIT)
pd.read_sql("SELECT TOP 5 * FROM payments;", engine)

  payment_id visit_id treatment_id  amount_paid payment_date payment_method
0    PAY0001    V0052          T03          200          NaT            EFT
1    PAY0002    V0339          T03          300   2024-05-01           Cash
2    PAY0003    V0202          T05          600   2024-09-08           Cash
3    PAY0004    V0185          T01          450          NaT           Cash
4    PAY0005    V0103          T01            0   2024-04-15            EFT